HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO136_FCR.
* To use register names with standard convension, please use CAN_MO136_FCR.
*/
#define	CAN_MOFCR136	(CAN_MO136_FCR)

/** \\brief  2104, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO136_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A104u)

/** Alias (User Manual Name) for CAN_MO136_FGPR.
* To use register names with standard convension, please use CAN_MO136_FGPR.
*/
#define	CAN_MOFGPR136	(CAN_MO136_FGPR)

/** \\brief  2108, Message Object  Interrupt Pointer Register */
#define CAN_MO136_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A108u)

/** Alias (User Manual Name) for CAN_MO136_IPR.
* To use register names with standard convension, please use CAN_MO136_IPR.
*/
#define	CAN_MOIPR136	(CAN_MO136_IPR)

/** \\brief  211C, Message Object  Control Register */
#define CAN_MO136_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A11Cu)

/** Alias (User Manual Name) for CAN_MO136_STAT.
* To use register names with standard convension, please use CAN_MO136_STAT.
*/
#define	CAN_MOSTAT136	(CAN_MO136_STAT)

/** \\brief  212C, Message Object  Acceptance Mask Register */
#define CAN_MO137_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A12Cu)

/** Alias (User Manual Name) for CAN_MO137_AMR.
* To use register names with standard convension, please use CAN_MO137_AMR.
*/
#define	CAN_MOAMR137	(CAN_MO137_AMR)

/** \\brief  2138, Message Object  Arbitration Register */
#define CAN_MO137_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A138u)

/** Alias (User Manual Name) for CAN_MO137_AR.
* To use register names with standard convension, please use CAN_MO137_AR.
*/
#define	CAN_MOAR137	(CAN_MO137_AR)

/** \\brief  213C, Message Object  Control Register */
#define CAN_MO137_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A13Cu)

/** Alias (User Manual Name) for CAN_MO137_CTR.
* To use register names with standard convension, please use CAN_MO137_CTR.
*/
#define	CAN_MOCTR137	(CAN_MO137_CTR)

/** \\brief  2134, Message Object  Data Register High */
#define CAN_MO137_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A134u)

/** Alias (User Manual Name) for CAN_MO137_DATAH.
* To use register names with standard convension, please use CAN_MO137_DATAH.
*/
#define	CAN_MODATAH137	(CAN_MO137_DATAH)

/** \\brief  2130, Message Object  Data Register Low */
#define CAN_MO137_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A130u)

/** Alias (User Manual Name) for CAN_MO137_DATAL.
* To use register names with standard convension, please use CAN_MO137_DATAL.
*/
#define	CAN_MODATAL137	(CAN_MO137_DATAL)

/** \\brief  2120, Message Object  Function Control Register */
#define CAN_MO137_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A120u)

/** Alias (User Manual Name) for CAN_MO137_FCR.
* To use register names with standard convension, please use CAN_MO137_FCR.
*/
#define	CAN_MOFCR137	(CAN_MO137_FCR)

/** \\brief  2124, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO137_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A124u)

/** Alias (User Manual Name) for CAN_MO137_FGPR.
* To use register names with standard convension, please use CAN_MO137_FGPR.
*/
#define	CAN_MOFGPR137	(CAN_MO137_FGPR)

/** \\brief  2128, Message Object  Interrupt Pointer Register */
#define CAN_MO137_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A128u)

/** Alias (User Manual Name) for CAN_MO137_IPR.
* To use register names with standard convension, please use CAN_MO137_IPR.
*/
#define	CAN_MOIPR137	(CAN_MO137_IPR)

/** \\brief  213C, Message Object  Control Register */
#define CAN_MO137_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A13Cu)

/** Alias (User Manual Name) for CAN_MO137_STAT.
* To use register names with standard convension, please use CAN_MO137_STAT.
*/
#define	CAN_MOSTAT137	(CAN_MO137_STAT)

/** \\brief  214C, Message Object  Acceptance Mask Register */
#define CAN_MO138_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A14Cu)

/** Alias (User Manual Name) for CAN_MO138_AMR.
* To use register names with standard convension, please use CAN_MO138_AMR.
*/
#define	CAN_MOAMR138	(CAN_MO138_AMR)

/** \\brief  2158, Message Object  Arbitration Register */
#define CAN_MO138_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A158u)

/** Alias (User Manual Name) for CAN_MO138_AR.
* To use register names with standard convension, please use CAN_MO138_AR.
*/
#define	CAN_MOAR138	(CAN_MO138_AR)

/** \\brief  215C, Message Object  Control Register */
#define CAN_MO138_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A15Cu)

/** Alias (User Manual Name) for CAN_MO138_CTR.
* To use register names with standard convension, please use CAN_MO138_CTR.
*/
#define	CAN_MOCTR138	(CAN_MO138_CTR)

/** \\brief  2154, Message Object  Data Register High */
#define CAN_MO138_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A154u)

/** Alias (User Manual Name) for CAN_MO138_DATAH.
* To use register names with standard convension, please use CAN_MO138_DATAH.
*/
#define	CAN_MODATAH138	(CAN_MO138_DATAH)

/** \\brief  2150, Message Object  Data Register Low */
#define CAN_MO138_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A150u)

/** Alias (User Manual Name) for CAN_MO138_DATAL.
* To use register names with standard convension, please use CAN_MO138_DATAL.
*/
#define	CAN_MODATAL138	(CAN_MO138_DATAL)

/** \\brief  2140, Message Object  Function Control Register */
#define CAN_MO138_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A140u)

/** Alias (User Manual Name) for CAN_MO138_FCR.
* To use register names with standard convension, please use CAN_MO138_FCR.
*/
#define	CAN_MOFCR138	(CAN_MO138_FCR)

/** \\brief  2144, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO138_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A144u)

/** Alias (User Manual Name) for CAN_MO138_FGPR.
* To use register names with standard convension, please use CAN_MO138_FGPR.
*/
#define	CAN_MOFGPR138	(CAN_MO138_FGPR)

/** \\brief  2148, Message Object  Interrupt Pointer Register */
#define CAN_MO138_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A148u)

/** Alias (User Manual Name) for CAN_MO138_IPR.
* To use register names with standard convension, please use CAN_MO138_IPR.
*/
#define	CAN_MOIPR138	(CAN_MO138_IPR)

/** \\brief  215C, Message Object  Control Register */
#define CAN_MO138_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A15Cu)

/** Alias (User Manual Name) for CAN_MO138_STAT.
* To use register names with standard convension, please use CAN_MO138_STAT.
*/
#define	CAN_MOSTAT138	(CAN_MO138_STAT)

/** \\brief  216C, Message Object  Acceptance Mask Register */
#define CAN_MO139_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A16Cu)

/** Alias (User Manual Name) for CAN_MO139_AMR.
* To use register names with standard convension, please use CAN_MO139_AMR.
*/
#define	CAN_MOAMR139	(CAN_MO139_AMR)

