HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO155_DATAH.
* To use register names with standard convension, please use CAN_MO155_DATAH.
*/
#define	CAN_MODATAH155	(CAN_MO155_DATAH)

/** \\brief  2370, Message Object  Data Register Low */
#define CAN_MO155_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A370u)

/** Alias (User Manual Name) for CAN_MO155_DATAL.
* To use register names with standard convension, please use CAN_MO155_DATAL.
*/
#define	CAN_MODATAL155	(CAN_MO155_DATAL)

/** \\brief  2360, Message Object  Function Control Register */
#define CAN_MO155_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A360u)

/** Alias (User Manual Name) for CAN_MO155_FCR.
* To use register names with standard convension, please use CAN_MO155_FCR.
*/
#define	CAN_MOFCR155	(CAN_MO155_FCR)

/** \\brief  2364, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO155_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A364u)

/** Alias (User Manual Name) for CAN_MO155_FGPR.
* To use register names with standard convension, please use CAN_MO155_FGPR.
*/
#define	CAN_MOFGPR155	(CAN_MO155_FGPR)

/** \\brief  2368, Message Object  Interrupt Pointer Register */
#define CAN_MO155_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A368u)

/** Alias (User Manual Name) for CAN_MO155_IPR.
* To use register names with standard convension, please use CAN_MO155_IPR.
*/
#define	CAN_MOIPR155	(CAN_MO155_IPR)

/** \\brief  237C, Message Object  Control Register */
#define CAN_MO155_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A37Cu)

/** Alias (User Manual Name) for CAN_MO155_STAT.
* To use register names with standard convension, please use CAN_MO155_STAT.
*/
#define	CAN_MOSTAT155	(CAN_MO155_STAT)

/** \\brief  238C, Message Object  Acceptance Mask Register */
#define CAN_MO156_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A38Cu)

/** Alias (User Manual Name) for CAN_MO156_AMR.
* To use register names with standard convension, please use CAN_MO156_AMR.
*/
#define	CAN_MOAMR156	(CAN_MO156_AMR)

/** \\brief  2398, Message Object  Arbitration Register */
#define CAN_MO156_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A398u)

/** Alias (User Manual Name) for CAN_MO156_AR.
* To use register names with standard convension, please use CAN_MO156_AR.
*/
#define	CAN_MOAR156	(CAN_MO156_AR)

/** \\brief  239C, Message Object  Control Register */
#define CAN_MO156_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A39Cu)

/** Alias (User Manual Name) for CAN_MO156_CTR.
* To use register names with standard convension, please use CAN_MO156_CTR.
*/
#define	CAN_MOCTR156	(CAN_MO156_CTR)

/** \\brief  2394, Message Object  Data Register High */
#define CAN_MO156_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A394u)

/** Alias (User Manual Name) for CAN_MO156_DATAH.
* To use register names with standard convension, please use CAN_MO156_DATAH.
*/
#define	CAN_MODATAH156	(CAN_MO156_DATAH)

/** \\brief  2390, Message Object  Data Register Low */
#define CAN_MO156_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A390u)

/** Alias (User Manual Name) for CAN_MO156_DATAL.
* To use register names with standard convension, please use CAN_MO156_DATAL.
*/
#define	CAN_MODATAL156	(CAN_MO156_DATAL)

/** \\brief  2380, Message Object  Function Control Register */
#define CAN_MO156_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A380u)

/** Alias (User Manual Name) for CAN_MO156_FCR.
* To use register names with standard convension, please use CAN_MO156_FCR.
*/
#define	CAN_MOFCR156	(CAN_MO156_FCR)

/** \\brief  2384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO156_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A384u)

/** Alias (User Manual Name) for CAN_MO156_FGPR.
* To use register names with standard convension, please use CAN_MO156_FGPR.
*/
#define	CAN_MOFGPR156	(CAN_MO156_FGPR)

/** \\brief  2388, Message Object  Interrupt Pointer Register */
#define CAN_MO156_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A388u)

/** Alias (User Manual Name) for CAN_MO156_IPR.
* To use register names with standard convension, please use CAN_MO156_IPR.
*/
#define	CAN_MOIPR156	(CAN_MO156_IPR)

/** \\brief  239C, Message Object  Control Register */
#define CAN_MO156_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A39Cu)

/** Alias (User Manual Name) for CAN_MO156_STAT.
* To use register names with standard convension, please use CAN_MO156_STAT.
*/
#define	CAN_MOSTAT156	(CAN_MO156_STAT)

/** \\brief  23AC, Message Object  Acceptance Mask Register */
#define CAN_MO157_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ACu)

/** Alias (User Manual Name) for CAN_MO157_AMR.
* To use register names with standard convension, please use CAN_MO157_AMR.
*/
#define	CAN_MOAMR157	(CAN_MO157_AMR)

/** \\brief  23B8, Message Object  Arbitration Register */
#define CAN_MO157_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3B8u)

/** Alias (User Manual Name) for CAN_MO157_AR.
* To use register names with standard convension, please use CAN_MO157_AR.
*/
#define	CAN_MOAR157	(CAN_MO157_AR)

/** \\brief  23BC, Message Object  Control Register */
#define CAN_MO157_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3BCu)

/** Alias (User Manual Name) for CAN_MO157_CTR.
* To use register names with standard convension, please use CAN_MO157_CTR.
*/
#define	CAN_MOCTR157	(CAN_MO157_CTR)

/** \\brief  23B4, Message Object  Data Register High */
#define CAN_MO157_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3B4u)

/** Alias (User Manual Name) for CAN_MO157_DATAH.
* To use register names with standard convension, please use CAN_MO157_DATAH.
*/
#define	CAN_MODATAH157	(CAN_MO157_DATAH)

/** \\brief  23B0, Message Object  Data Register Low */
#define CAN_MO157_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3B0u)

/** Alias (User Manual Name) for CAN_MO157_DATAL.
* To use register names with standard convension, please use CAN_MO157_DATAL.
*/
#define	CAN_MODATAL157	(CAN_MO157_DATAL)

/** \\brief  23A0, Message Object  Function Control Register */
#define CAN_MO157_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3A0u)

/** Alias (User Manual Name) for CAN_MO157_FCR.
* To use register names with standard convension, please use CAN_MO157_FCR.
*/
#define	CAN_MOFCR157	(CAN_MO157_FCR)

