HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO180_CTR.
* To use register names with standard convension, please use CAN_MO180_CTR.
*/
#define	CAN_MOCTR180	(CAN_MO180_CTR)

/** \\brief  2694, Message Object  Data Register High */
#define CAN_MO180_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A694u)

/** Alias (User Manual Name) for CAN_MO180_DATAH.
* To use register names with standard convension, please use CAN_MO180_DATAH.
*/
#define	CAN_MODATAH180	(CAN_MO180_DATAH)

/** \\brief  2690, Message Object  Data Register Low */
#define CAN_MO180_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A690u)

/** Alias (User Manual Name) for CAN_MO180_DATAL.
* To use register names with standard convension, please use CAN_MO180_DATAL.
*/
#define	CAN_MODATAL180	(CAN_MO180_DATAL)

/** \\brief  2680, Message Object  Function Control Register */
#define CAN_MO180_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A680u)

/** Alias (User Manual Name) for CAN_MO180_FCR.
* To use register names with standard convension, please use CAN_MO180_FCR.
*/
#define	CAN_MOFCR180	(CAN_MO180_FCR)

/** \\brief  2684, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO180_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A684u)

/** Alias (User Manual Name) for CAN_MO180_FGPR.
* To use register names with standard convension, please use CAN_MO180_FGPR.
*/
#define	CAN_MOFGPR180	(CAN_MO180_FGPR)

/** \\brief  2688, Message Object  Interrupt Pointer Register */
#define CAN_MO180_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A688u)

/** Alias (User Manual Name) for CAN_MO180_IPR.
* To use register names with standard convension, please use CAN_MO180_IPR.
*/
#define	CAN_MOIPR180	(CAN_MO180_IPR)

/** \\brief  269C, Message Object  Control Register */
#define CAN_MO180_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A69Cu)

/** Alias (User Manual Name) for CAN_MO180_STAT.
* To use register names with standard convension, please use CAN_MO180_STAT.
*/
#define	CAN_MOSTAT180	(CAN_MO180_STAT)

/** \\brief  26AC, Message Object  Acceptance Mask Register */
#define CAN_MO181_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6ACu)

/** Alias (User Manual Name) for CAN_MO181_AMR.
* To use register names with standard convension, please use CAN_MO181_AMR.
*/
#define	CAN_MOAMR181	(CAN_MO181_AMR)

/** \\brief  26B8, Message Object  Arbitration Register */
#define CAN_MO181_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6B8u)

/** Alias (User Manual Name) for CAN_MO181_AR.
* To use register names with standard convension, please use CAN_MO181_AR.
*/
#define	CAN_MOAR181	(CAN_MO181_AR)

/** \\brief  26BC, Message Object  Control Register */
#define CAN_MO181_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A6BCu)

/** Alias (User Manual Name) for CAN_MO181_CTR.
* To use register names with standard convension, please use CAN_MO181_CTR.
*/
#define	CAN_MOCTR181	(CAN_MO181_CTR)

/** \\brief  26B4, Message Object  Data Register High */
#define CAN_MO181_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6B4u)

/** Alias (User Manual Name) for CAN_MO181_DATAH.
* To use register names with standard convension, please use CAN_MO181_DATAH.
*/
#define	CAN_MODATAH181	(CAN_MO181_DATAH)

/** \\brief  26B0, Message Object  Data Register Low */
#define CAN_MO181_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6B0u)

/** Alias (User Manual Name) for CAN_MO181_DATAL.
* To use register names with standard convension, please use CAN_MO181_DATAL.
*/
#define	CAN_MODATAL181	(CAN_MO181_DATAL)

/** \\brief  26A0, Message Object  Function Control Register */
#define CAN_MO181_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6A0u)

/** Alias (User Manual Name) for CAN_MO181_FCR.
* To use register names with standard convension, please use CAN_MO181_FCR.
*/
#define	CAN_MOFCR181	(CAN_MO181_FCR)

/** \\brief  26A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO181_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A6A4u)

/** Alias (User Manual Name) for CAN_MO181_FGPR.
* To use register names with standard convension, please use CAN_MO181_FGPR.
*/
#define	CAN_MOFGPR181	(CAN_MO181_FGPR)

/** \\brief  26A8, Message Object  Interrupt Pointer Register */
#define CAN_MO181_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A6A8u)

/** Alias (User Manual Name) for CAN_MO181_IPR.
* To use register names with standard convension, please use CAN_MO181_IPR.
*/
#define	CAN_MOIPR181	(CAN_MO181_IPR)

/** \\brief  26BC, Message Object  Control Register */
#define CAN_MO181_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A6BCu)

/** Alias (User Manual Name) for CAN_MO181_STAT.
* To use register names with standard convension, please use CAN_MO181_STAT.
*/
#define	CAN_MOSTAT181	(CAN_MO181_STAT)

/** \\brief  26CC, Message Object  Acceptance Mask Register */
#define CAN_MO182_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6CCu)

/** Alias (User Manual Name) for CAN_MO182_AMR.
* To use register names with standard convension, please use CAN_MO182_AMR.
*/
#define	CAN_MOAMR182	(CAN_MO182_AMR)

/** \\brief  26D8, Message Object  Arbitration Register */
#define CAN_MO182_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6D8u)

/** Alias (User Manual Name) for CAN_MO182_AR.
* To use register names with standard convension, please use CAN_MO182_AR.
*/
#define	CAN_MOAR182	(CAN_MO182_AR)

/** \\brief  26DC, Message Object  Control Register */
#define CAN_MO182_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A6DCu)

/** Alias (User Manual Name) for CAN_MO182_CTR.
* To use register names with standard convension, please use CAN_MO182_CTR.
*/
#define	CAN_MOCTR182	(CAN_MO182_CTR)

/** \\brief  26D4, Message Object  Data Register High */
#define CAN_MO182_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6D4u)

/** Alias (User Manual Name) for CAN_MO182_DATAH.
* To use register names with standard convension, please use CAN_MO182_DATAH.
*/
#define	CAN_MODATAH182	(CAN_MO182_DATAH)

/** \\brief  26D0, Message Object  Data Register Low */
#define CAN_MO182_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6D0u)

/** Alias (User Manual Name) for CAN_MO182_DATAL.
* To use register names with standard convension, please use CAN_MO182_DATAL.
*/
#define	CAN_MODATAL182	(CAN_MO182_DATAL)

/** \\brief  26C0, Message Object  Function Control Register */
#define CAN_MO182_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6C0u)

