HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO195_AR.
* To use register names with standard convension, please use CAN_MO195_AR.
*/
#define	CAN_MOAR195	(CAN_MO195_AR)

/** \\brief  287C, Message Object  Control Register */
#define CAN_MO195_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A87Cu)

/** Alias (User Manual Name) for CAN_MO195_CTR.
* To use register names with standard convension, please use CAN_MO195_CTR.
*/
#define	CAN_MOCTR195	(CAN_MO195_CTR)

/** \\brief  2874, Message Object  Data Register High */
#define CAN_MO195_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A874u)

/** Alias (User Manual Name) for CAN_MO195_DATAH.
* To use register names with standard convension, please use CAN_MO195_DATAH.
*/
#define	CAN_MODATAH195	(CAN_MO195_DATAH)

/** \\brief  2870, Message Object  Data Register Low */
#define CAN_MO195_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A870u)

/** Alias (User Manual Name) for CAN_MO195_DATAL.
* To use register names with standard convension, please use CAN_MO195_DATAL.
*/
#define	CAN_MODATAL195	(CAN_MO195_DATAL)

/** \\brief  2860, Message Object  Function Control Register */
#define CAN_MO195_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A860u)

/** Alias (User Manual Name) for CAN_MO195_FCR.
* To use register names with standard convension, please use CAN_MO195_FCR.
*/
#define	CAN_MOFCR195	(CAN_MO195_FCR)

/** \\brief  2864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO195_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A864u)

/** Alias (User Manual Name) for CAN_MO195_FGPR.
* To use register names with standard convension, please use CAN_MO195_FGPR.
*/
#define	CAN_MOFGPR195	(CAN_MO195_FGPR)

/** \\brief  2868, Message Object  Interrupt Pointer Register */
#define CAN_MO195_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A868u)

/** Alias (User Manual Name) for CAN_MO195_IPR.
* To use register names with standard convension, please use CAN_MO195_IPR.
*/
#define	CAN_MOIPR195	(CAN_MO195_IPR)

/** \\brief  287C, Message Object  Control Register */
#define CAN_MO195_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A87Cu)

/** Alias (User Manual Name) for CAN_MO195_STAT.
* To use register names with standard convension, please use CAN_MO195_STAT.
*/
#define	CAN_MOSTAT195	(CAN_MO195_STAT)

/** \\brief  288C, Message Object  Acceptance Mask Register */
#define CAN_MO196_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A88Cu)

/** Alias (User Manual Name) for CAN_MO196_AMR.
* To use register names with standard convension, please use CAN_MO196_AMR.
*/
#define	CAN_MOAMR196	(CAN_MO196_AMR)

/** \\brief  2898, Message Object  Arbitration Register */
#define CAN_MO196_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A898u)

/** Alias (User Manual Name) for CAN_MO196_AR.
* To use register names with standard convension, please use CAN_MO196_AR.
*/
#define	CAN_MOAR196	(CAN_MO196_AR)

/** \\brief  289C, Message Object  Control Register */
#define CAN_MO196_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A89Cu)

/** Alias (User Manual Name) for CAN_MO196_CTR.
* To use register names with standard convension, please use CAN_MO196_CTR.
*/
#define	CAN_MOCTR196	(CAN_MO196_CTR)

/** \\brief  2894, Message Object  Data Register High */
#define CAN_MO196_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A894u)

/** Alias (User Manual Name) for CAN_MO196_DATAH.
* To use register names with standard convension, please use CAN_MO196_DATAH.
*/
#define	CAN_MODATAH196	(CAN_MO196_DATAH)

/** \\brief  2890, Message Object  Data Register Low */
#define CAN_MO196_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A890u)

/** Alias (User Manual Name) for CAN_MO196_DATAL.
* To use register names with standard convension, please use CAN_MO196_DATAL.
*/
#define	CAN_MODATAL196	(CAN_MO196_DATAL)

/** \\brief  2880, Message Object  Function Control Register */
#define CAN_MO196_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A880u)

/** Alias (User Manual Name) for CAN_MO196_FCR.
* To use register names with standard convension, please use CAN_MO196_FCR.
*/
#define	CAN_MOFCR196	(CAN_MO196_FCR)

/** \\brief  2884, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO196_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A884u)

/** Alias (User Manual Name) for CAN_MO196_FGPR.
* To use register names with standard convension, please use CAN_MO196_FGPR.
*/
#define	CAN_MOFGPR196	(CAN_MO196_FGPR)

/** \\brief  2888, Message Object  Interrupt Pointer Register */
#define CAN_MO196_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A888u)

/** Alias (User Manual Name) for CAN_MO196_IPR.
* To use register names with standard convension, please use CAN_MO196_IPR.
*/
#define	CAN_MOIPR196	(CAN_MO196_IPR)

/** \\brief  289C, Message Object  Control Register */
#define CAN_MO196_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A89Cu)

/** Alias (User Manual Name) for CAN_MO196_STAT.
* To use register names with standard convension, please use CAN_MO196_STAT.
*/
#define	CAN_MOSTAT196	(CAN_MO196_STAT)

/** \\brief  28AC, Message Object  Acceptance Mask Register */
#define CAN_MO197_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8ACu)

/** Alias (User Manual Name) for CAN_MO197_AMR.
* To use register names with standard convension, please use CAN_MO197_AMR.
*/
#define	CAN_MOAMR197	(CAN_MO197_AMR)

/** \\brief  28B8, Message Object  Arbitration Register */
#define CAN_MO197_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8B8u)

/** Alias (User Manual Name) for CAN_MO197_AR.
* To use register names with standard convension, please use CAN_MO197_AR.
*/
#define	CAN_MOAR197	(CAN_MO197_AR)

/** \\brief  28BC, Message Object  Control Register */
#define CAN_MO197_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A8BCu)

/** Alias (User Manual Name) for CAN_MO197_CTR.
* To use register names with standard convension, please use CAN_MO197_CTR.
*/
#define	CAN_MOCTR197	(CAN_MO197_CTR)

/** \\brief  28B4, Message Object  Data Register High */
#define CAN_MO197_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8B4u)

/** Alias (User Manual Name) for CAN_MO197_DATAH.
* To use register names with standard convension, please use CAN_MO197_DATAH.
*/
#define	CAN_MODATAH197	(CAN_MO197_DATAH)

/** \\brief  28B0, Message Object  Data Register Low */
#define CAN_MO197_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8B0u)

/** Alias (User Manual Name) for CAN_MO197_DATAL.
* To use register names with standard convension, please use CAN_MO197_DATAL.
*/
#define	CAN_MODATAL197	(CAN_MO197_DATAL)

/** \\brief  28A0, Message Object  Function Control Register */
#define CAN_MO197_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8A0u)

/** Alias (User Manual Name) for CAN_MO197_FCR.
* To use register names with standard convension, please use CAN_MO197_FCR.
*/
#define	CAN_MOFCR197	(CAN_MO197_FCR)

/** \\brief  28A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO197_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8A4u)

/** Alias (User Manual Name) for CAN_MO197_FGPR.
* To use register names with standard convension, please use CAN_MO197_FGPR.
*/
#define	CAN_MOFGPR197	(CAN_MO197_FGPR)

