HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO215_FCR.
* To use register names with standard convension, please use CAN_MO215_FCR.
*/
#define	CAN_MOFCR215	(CAN_MO215_FCR)

/** \\brief  2AE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO215_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AAE4u)

/** Alias (User Manual Name) for CAN_MO215_FGPR.
* To use register names with standard convension, please use CAN_MO215_FGPR.
*/
#define	CAN_MOFGPR215	(CAN_MO215_FGPR)

/** \\brief  2AE8, Message Object  Interrupt Pointer Register */
#define CAN_MO215_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AAE8u)

/** Alias (User Manual Name) for CAN_MO215_IPR.
* To use register names with standard convension, please use CAN_MO215_IPR.
*/
#define	CAN_MOIPR215	(CAN_MO215_IPR)

/** \\brief  2AFC, Message Object  Control Register */
#define CAN_MO215_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AAFCu)

/** Alias (User Manual Name) for CAN_MO215_STAT.
* To use register names with standard convension, please use CAN_MO215_STAT.
*/
#define	CAN_MOSTAT215	(CAN_MO215_STAT)

/** \\brief  2B0C, Message Object  Acceptance Mask Register */
#define CAN_MO216_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB0Cu)

/** Alias (User Manual Name) for CAN_MO216_AMR.
* To use register names with standard convension, please use CAN_MO216_AMR.
*/
#define	CAN_MOAMR216	(CAN_MO216_AMR)

/** \\brief  2B18, Message Object  Arbitration Register */
#define CAN_MO216_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB18u)

/** Alias (User Manual Name) for CAN_MO216_AR.
* To use register names with standard convension, please use CAN_MO216_AR.
*/
#define	CAN_MOAR216	(CAN_MO216_AR)

/** \\brief  2B1C, Message Object  Control Register */
#define CAN_MO216_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB1Cu)

/** Alias (User Manual Name) for CAN_MO216_CTR.
* To use register names with standard convension, please use CAN_MO216_CTR.
*/
#define	CAN_MOCTR216	(CAN_MO216_CTR)

/** \\brief  2B14, Message Object  Data Register High */
#define CAN_MO216_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB14u)

/** Alias (User Manual Name) for CAN_MO216_DATAH.
* To use register names with standard convension, please use CAN_MO216_DATAH.
*/
#define	CAN_MODATAH216	(CAN_MO216_DATAH)

/** \\brief  2B10, Message Object  Data Register Low */
#define CAN_MO216_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB10u)

/** Alias (User Manual Name) for CAN_MO216_DATAL.
* To use register names with standard convension, please use CAN_MO216_DATAL.
*/
#define	CAN_MODATAL216	(CAN_MO216_DATAL)

/** \\brief  2B00, Message Object  Function Control Register */
#define CAN_MO216_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB00u)

/** Alias (User Manual Name) for CAN_MO216_FCR.
* To use register names with standard convension, please use CAN_MO216_FCR.
*/
#define	CAN_MOFCR216	(CAN_MO216_FCR)

/** \\brief  2B04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO216_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB04u)

/** Alias (User Manual Name) for CAN_MO216_FGPR.
* To use register names with standard convension, please use CAN_MO216_FGPR.
*/
#define	CAN_MOFGPR216	(CAN_MO216_FGPR)

/** \\brief  2B08, Message Object  Interrupt Pointer Register */
#define CAN_MO216_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB08u)

/** Alias (User Manual Name) for CAN_MO216_IPR.
* To use register names with standard convension, please use CAN_MO216_IPR.
*/
#define	CAN_MOIPR216	(CAN_MO216_IPR)

/** \\brief  2B1C, Message Object  Control Register */
#define CAN_MO216_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB1Cu)

/** Alias (User Manual Name) for CAN_MO216_STAT.
* To use register names with standard convension, please use CAN_MO216_STAT.
*/
#define	CAN_MOSTAT216	(CAN_MO216_STAT)

/** \\brief  2B2C, Message Object  Acceptance Mask Register */
#define CAN_MO217_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB2Cu)

/** Alias (User Manual Name) for CAN_MO217_AMR.
* To use register names with standard convension, please use CAN_MO217_AMR.
*/
#define	CAN_MOAMR217	(CAN_MO217_AMR)

/** \\brief  2B38, Message Object  Arbitration Register */
#define CAN_MO217_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB38u)

/** Alias (User Manual Name) for CAN_MO217_AR.
* To use register names with standard convension, please use CAN_MO217_AR.
*/
#define	CAN_MOAR217	(CAN_MO217_AR)

/** \\brief  2B3C, Message Object  Control Register */
#define CAN_MO217_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB3Cu)

/** Alias (User Manual Name) for CAN_MO217_CTR.
* To use register names with standard convension, please use CAN_MO217_CTR.
*/
#define	CAN_MOCTR217	(CAN_MO217_CTR)

/** \\brief  2B34, Message Object  Data Register High */
#define CAN_MO217_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB34u)

/** Alias (User Manual Name) for CAN_MO217_DATAH.
* To use register names with standard convension, please use CAN_MO217_DATAH.
*/
#define	CAN_MODATAH217	(CAN_MO217_DATAH)

/** \\brief  2B30, Message Object  Data Register Low */
#define CAN_MO217_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB30u)

/** Alias (User Manual Name) for CAN_MO217_DATAL.
* To use register names with standard convension, please use CAN_MO217_DATAL.
*/
#define	CAN_MODATAL217	(CAN_MO217_DATAL)

/** \\brief  2B20, Message Object  Function Control Register */
#define CAN_MO217_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB20u)

/** Alias (User Manual Name) for CAN_MO217_FCR.
* To use register names with standard convension, please use CAN_MO217_FCR.
*/
#define	CAN_MOFCR217	(CAN_MO217_FCR)

/** \\brief  2B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO217_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB24u)

/** Alias (User Manual Name) for CAN_MO217_FGPR.
* To use register names with standard convension, please use CAN_MO217_FGPR.
*/
#define	CAN_MOFGPR217	(CAN_MO217_FGPR)

/** \\brief  2B28, Message Object  Interrupt Pointer Register */
#define CAN_MO217_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB28u)

