HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO217_IPR.
* To use register names with standard convension, please use CAN_MO217_IPR.
*/
#define	CAN_MOIPR217	(CAN_MO217_IPR)

/** \\brief  2B3C, Message Object  Control Register */
#define CAN_MO217_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB3Cu)

/** Alias (User Manual Name) for CAN_MO217_STAT.
* To use register names with standard convension, please use CAN_MO217_STAT.
*/
#define	CAN_MOSTAT217	(CAN_MO217_STAT)

/** \\brief  2B4C, Message Object  Acceptance Mask Register */
#define CAN_MO218_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB4Cu)

/** Alias (User Manual Name) for CAN_MO218_AMR.
* To use register names with standard convension, please use CAN_MO218_AMR.
*/
#define	CAN_MOAMR218	(CAN_MO218_AMR)

/** \\brief  2B58, Message Object  Arbitration Register */
#define CAN_MO218_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB58u)

/** Alias (User Manual Name) for CAN_MO218_AR.
* To use register names with standard convension, please use CAN_MO218_AR.
*/
#define	CAN_MOAR218	(CAN_MO218_AR)

/** \\brief  2B5C, Message Object  Control Register */
#define CAN_MO218_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB5Cu)

/** Alias (User Manual Name) for CAN_MO218_CTR.
* To use register names with standard convension, please use CAN_MO218_CTR.
*/
#define	CAN_MOCTR218	(CAN_MO218_CTR)

/** \\brief  2B54, Message Object  Data Register High */
#define CAN_MO218_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB54u)

/** Alias (User Manual Name) for CAN_MO218_DATAH.
* To use register names with standard convension, please use CAN_MO218_DATAH.
*/
#define	CAN_MODATAH218	(CAN_MO218_DATAH)

/** \\brief  2B50, Message Object  Data Register Low */
#define CAN_MO218_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB50u)

/** Alias (User Manual Name) for CAN_MO218_DATAL.
* To use register names with standard convension, please use CAN_MO218_DATAL.
*/
#define	CAN_MODATAL218	(CAN_MO218_DATAL)

/** \\brief  2B40, Message Object  Function Control Register */
#define CAN_MO218_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB40u)

/** Alias (User Manual Name) for CAN_MO218_FCR.
* To use register names with standard convension, please use CAN_MO218_FCR.
*/
#define	CAN_MOFCR218	(CAN_MO218_FCR)

/** \\brief  2B44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO218_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB44u)

/** Alias (User Manual Name) for CAN_MO218_FGPR.
* To use register names with standard convension, please use CAN_MO218_FGPR.
*/
#define	CAN_MOFGPR218	(CAN_MO218_FGPR)

/** \\brief  2B48, Message Object  Interrupt Pointer Register */
#define CAN_MO218_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB48u)

/** Alias (User Manual Name) for CAN_MO218_IPR.
* To use register names with standard convension, please use CAN_MO218_IPR.
*/
#define	CAN_MOIPR218	(CAN_MO218_IPR)

/** \\brief  2B5C, Message Object  Control Register */
#define CAN_MO218_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB5Cu)

/** Alias (User Manual Name) for CAN_MO218_STAT.
* To use register names with standard convension, please use CAN_MO218_STAT.
*/
#define	CAN_MOSTAT218	(CAN_MO218_STAT)

/** \\brief  2B6C, Message Object  Acceptance Mask Register */
#define CAN_MO219_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB6Cu)

/** Alias (User Manual Name) for CAN_MO219_AMR.
* To use register names with standard convension, please use CAN_MO219_AMR.
*/
#define	CAN_MOAMR219	(CAN_MO219_AMR)

/** \\brief  2B78, Message Object  Arbitration Register */
#define CAN_MO219_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB78u)

/** Alias (User Manual Name) for CAN_MO219_AR.
* To use register names with standard convension, please use CAN_MO219_AR.
*/
#define	CAN_MOAR219	(CAN_MO219_AR)

/** \\brief  2B7C, Message Object  Control Register */
#define CAN_MO219_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB7Cu)

/** Alias (User Manual Name) for CAN_MO219_CTR.
* To use register names with standard convension, please use CAN_MO219_CTR.
*/
#define	CAN_MOCTR219	(CAN_MO219_CTR)

/** \\brief  2B74, Message Object  Data Register High */
#define CAN_MO219_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB74u)

/** Alias (User Manual Name) for CAN_MO219_DATAH.
* To use register names with standard convension, please use CAN_MO219_DATAH.
*/
#define	CAN_MODATAH219	(CAN_MO219_DATAH)

/** \\brief  2B70, Message Object  Data Register Low */
#define CAN_MO219_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB70u)

/** Alias (User Manual Name) for CAN_MO219_DATAL.
* To use register names with standard convension, please use CAN_MO219_DATAL.
*/
#define	CAN_MODATAL219	(CAN_MO219_DATAL)

/** \\brief  2B60, Message Object  Function Control Register */
#define CAN_MO219_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB60u)

/** Alias (User Manual Name) for CAN_MO219_FCR.
* To use register names with standard convension, please use CAN_MO219_FCR.
*/
#define	CAN_MOFCR219	(CAN_MO219_FCR)

/** \\brief  2B64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO219_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB64u)

/** Alias (User Manual Name) for CAN_MO219_FGPR.
* To use register names with standard convension, please use CAN_MO219_FGPR.
*/
#define	CAN_MOFGPR219	(CAN_MO219_FGPR)

/** \\brief  2B68, Message Object  Interrupt Pointer Register */
#define CAN_MO219_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB68u)

/** Alias (User Manual Name) for CAN_MO219_IPR.
* To use register names with standard convension, please use CAN_MO219_IPR.
*/
#define	CAN_MOIPR219	(CAN_MO219_IPR)

/** \\brief  2B7C, Message Object  Control Register */
#define CAN_MO219_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB7Cu)

/** Alias (User Manual Name) for CAN_MO219_STAT.
* To use register names with standard convension, please use CAN_MO219_STAT.
*/
#define	CAN_MOSTAT219	(CAN_MO219_STAT)

