HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_N2_CR.
* To use register names with standard convension, please use CAN_N2_CR.
*/
#define	CAN_NCR2	(CAN_N2_CR)

/** \\brief  414, Node Error Counter Register */
#define CAN_N2_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018414u)

/** Alias (User Manual Name) for CAN_N2_ECNT.
* To use register names with standard convension, please use CAN_N2_ECNT.
*/
#define	CAN_NECNT2	(CAN_N2_ECNT)

/** \\brief  418, Node Frame Counter Register */
#define CAN_N2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018418u)

/** Alias (User Manual Name) for CAN_N2_FCR.
* To use register names with standard convension, please use CAN_N2_FCR.
*/
#define	CAN_NFCR2	(CAN_N2_FCR)

/** \\brief  408, Node Interrupt Pointer Register */
#define CAN_N2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018408u)

/** Alias (User Manual Name) for CAN_N2_IPR.
* To use register names with standard convension, please use CAN_N2_IPR.
*/
#define	CAN_NIPR2	(CAN_N2_IPR)

/** \\brief  40C, Node Port Control Register */
#define CAN_N2_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001840Cu)

/** Alias (User Manual Name) for CAN_N2_PCR.
* To use register names with standard convension, please use CAN_N2_PCR.
*/
#define	CAN_NPCR2	(CAN_N2_PCR)

/** \\brief  404, Node Status Register */
#define CAN_N2_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018404u)

/** Alias (User Manual Name) for CAN_N2_SR.
* To use register names with standard convension, please use CAN_N2_SR.
*/
#define	CAN_NSR2	(CAN_N2_SR)

/** \\brief  424, Node Timer A Transmit Trigger Register */
#define CAN_N2_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018424u)

/** Alias (User Manual Name) for CAN_N2_TATTR.
* To use register names with standard convension, please use CAN_N2_TATTR.
*/
#define	CAN_NTATTR2	(CAN_N2_TATTR)

/** \\brief  428, Node Timer B Transmit Trigger Register */
#define CAN_N2_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018428u)

/** Alias (User Manual Name) for CAN_N2_TBTTR.
* To use register names with standard convension, please use CAN_N2_TBTTR.
*/
#define	CAN_NTBTTR2	(CAN_N2_TBTTR)

/** \\brief  41C, Node Timer Clock Control Register */
#define CAN_N2_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001841Cu)

/** Alias (User Manual Name) for CAN_N2_TCCR.
* To use register names with standard convension, please use CAN_N2_TCCR.
*/
#define	CAN_NTCCR2	(CAN_N2_TCCR)

/** \\brief  42C, Node Timer C Transmit Trigger Register */
#define CAN_N2_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001842Cu)

/** Alias (User Manual Name) for CAN_N2_TCTTR.
* To use register names with standard convension, please use CAN_N2_TCTTR.
*/
#define	CAN_NTCTTR2	(CAN_N2_TCTTR)

/** \\brief  420, Node Timer Receive Timeout Register */
#define CAN_N2_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018420u)

/** Alias (User Manual Name) for CAN_N2_TRTR.
* To use register names with standard convension, please use CAN_N2_TRTR.
*/
#define	CAN_NTRTR2	(CAN_N2_TRTR)

/** \\brief  510, Node Bit Timing Register */
#define CAN_N3_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018510u)

/** Alias (User Manual Name) for CAN_N3_BTR.
* To use register names with standard convension, please use CAN_N3_BTR.
*/
#define	CAN_NBTR3	(CAN_N3_BTR)

/** \\brief  500, Node Control Register */
#define CAN_N3_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018500u)

/** Alias (User Manual Name) for CAN_N3_CR.
* To use register names with standard convension, please use CAN_N3_CR.
*/
#define	CAN_NCR3	(CAN_N3_CR)

/** \\brief  514, Node Error Counter Register */
#define CAN_N3_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018514u)

/** Alias (User Manual Name) for CAN_N3_ECNT.
* To use register names with standard convension, please use CAN_N3_ECNT.
*/
#define	CAN_NECNT3	(CAN_N3_ECNT)

/** \\brief  518, Node Frame Counter Register */
#define CAN_N3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018518u)

/** Alias (User Manual Name) for CAN_N3_FCR.
* To use register names with standard convension, please use CAN_N3_FCR.
*/
#define	CAN_NFCR3	(CAN_N3_FCR)

/** \\brief  508, Node Interrupt Pointer Register */
#define CAN_N3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018508u)

/** Alias (User Manual Name) for CAN_N3_IPR.
* To use register names with standard convension, please use CAN_N3_IPR.
*/
#define	CAN_NIPR3	(CAN_N3_IPR)

/** \\brief  50C, Node Port Control Register */
#define CAN_N3_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001850Cu)

/** Alias (User Manual Name) for CAN_N3_PCR.
* To use register names with standard convension, please use CAN_N3_PCR.
*/
#define	CAN_NPCR3	(CAN_N3_PCR)

/** \\brief  504, Node Status Register */
#define CAN_N3_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018504u)

/** Alias (User Manual Name) for CAN_N3_SR.
* To use register names with standard convension, please use CAN_N3_SR.
*/
#define	CAN_NSR3	(CAN_N3_SR)

/** \\brief  524, Node Timer A Transmit Trigger Register */
#define CAN_N3_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018524u)

/** Alias (User Manual Name) for CAN_N3_TATTR.
* To use register names with standard convension, please use CAN_N3_TATTR.
*/
#define	CAN_NTATTR3	(CAN_N3_TATTR)

/** \\brief  528, Node Timer B Transmit Trigger Register */
#define CAN_N3_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018528u)

/** Alias (User Manual Name) for CAN_N3_TBTTR.
* To use register names with standard convension, please use CAN_N3_TBTTR.
*/
#define	CAN_NTBTTR3	(CAN_N3_TBTTR)

/** \\brief  51C, Node Timer Clock Control Register */
#define CAN_N3_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001851Cu)

/** Alias (User Manual Name) for CAN_N3_TCCR.
* To use register names with standard convension, please use CAN_N3_TCCR.
*/
#define	CAN_NTCCR3	(CAN_N3_TCCR)

/** \\brief  52C, Node Timer C Transmit Trigger Register */
#define CAN_N3_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001852Cu)

/** Alias (User Manual Name) for CAN_N3_TCTTR.
* To use register names with standard convension, please use CAN_N3_TCTTR.
*/
#define	CAN_NTCTTR3	(CAN_N3_TCTTR)

