HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** \\brief  520, Node Timer Receive Timeout Register */
#define CAN_N3_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018520u)

/** Alias (User Manual Name) for CAN_N3_TRTR.
* To use register names with standard convension, please use CAN_N3_TRTR.
*/
#define	CAN_NTRTR3	(CAN_N3_TRTR)

/** \\brief  610, Node Bit Timing Register */
#define CAN_N4_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018610u)

/** Alias (User Manual Name) for CAN_N4_BTR.
* To use register names with standard convension, please use CAN_N4_BTR.
*/
#define	CAN_NBTR4	(CAN_N4_BTR)

/** \\brief  600, Node Control Register */
#define CAN_N4_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018600u)

/** Alias (User Manual Name) for CAN_N4_CR.
* To use register names with standard convension, please use CAN_N4_CR.
*/
#define	CAN_NCR4	(CAN_N4_CR)

/** \\brief  614, Node Error Counter Register */
#define CAN_N4_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018614u)

/** Alias (User Manual Name) for CAN_N4_ECNT.
* To use register names with standard convension, please use CAN_N4_ECNT.
*/
#define	CAN_NECNT4	(CAN_N4_ECNT)

/** \\brief  618, Node Frame Counter Register */
#define CAN_N4_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018618u)

/** Alias (User Manual Name) for CAN_N4_FCR.
* To use register names with standard convension, please use CAN_N4_FCR.
*/
#define	CAN_NFCR4	(CAN_N4_FCR)

/** \\brief  608, Node Interrupt Pointer Register */
#define CAN_N4_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018608u)

/** Alias (User Manual Name) for CAN_N4_IPR.
* To use register names with standard convension, please use CAN_N4_IPR.
*/
#define	CAN_NIPR4	(CAN_N4_IPR)

/** \\brief  60C, Node Port Control Register */
#define CAN_N4_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001860Cu)

/** Alias (User Manual Name) for CAN_N4_PCR.
* To use register names with standard convension, please use CAN_N4_PCR.
*/
#define	CAN_NPCR4	(CAN_N4_PCR)

/** \\brief  604, Node Status Register */
#define CAN_N4_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018604u)

/** Alias (User Manual Name) for CAN_N4_SR.
* To use register names with standard convension, please use CAN_N4_SR.
*/
#define	CAN_NSR4	(CAN_N4_SR)

/** \\brief  624, Node Timer A Transmit Trigger Register */
#define CAN_N4_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018624u)

/** Alias (User Manual Name) for CAN_N4_TATTR.
* To use register names with standard convension, please use CAN_N4_TATTR.
*/
#define	CAN_NTATTR4	(CAN_N4_TATTR)

/** \\brief  628, Node Timer B Transmit Trigger Register */
#define CAN_N4_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018628u)

/** Alias (User Manual Name) for CAN_N4_TBTTR.
* To use register names with standard convension, please use CAN_N4_TBTTR.
*/
#define	CAN_NTBTTR4	(CAN_N4_TBTTR)

/** \\brief  61C, Node Timer Clock Control Register */
#define CAN_N4_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001861Cu)

/** Alias (User Manual Name) for CAN_N4_TCCR.
* To use register names with standard convension, please use CAN_N4_TCCR.
*/
#define	CAN_NTCCR4	(CAN_N4_TCCR)

/** \\brief  62C, Node Timer C Transmit Trigger Register */
#define CAN_N4_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001862Cu)

/** Alias (User Manual Name) for CAN_N4_TCTTR.
* To use register names with standard convension, please use CAN_N4_TCTTR.
*/
#define	CAN_NTCTTR4	(CAN_N4_TCTTR)

/** \\brief  620, Node Timer Receive Timeout Register */
#define CAN_N4_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018620u)

/** Alias (User Manual Name) for CAN_N4_TRTR.
* To use register names with standard convension, please use CAN_N4_TRTR.
*/
#define	CAN_NTRTR4	(CAN_N4_TRTR)

/** \\brief  710, Node Bit Timing Register */
#define CAN_N5_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018710u)

/** Alias (User Manual Name) for CAN_N5_BTR.
* To use register names with standard convension, please use CAN_N5_BTR.
*/
#define	CAN_NBTR5	(CAN_N5_BTR)

/** \\brief  700, Node Control Register */
#define CAN_N5_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018700u)

/** Alias (User Manual Name) for CAN_N5_CR.
* To use register names with standard convension, please use CAN_N5_CR.
*/
#define	CAN_NCR5	(CAN_N5_CR)

/** \\brief  714, Node Error Counter Register */
#define CAN_N5_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018714u)

/** Alias (User Manual Name) for CAN_N5_ECNT.
* To use register names with standard convension, please use CAN_N5_ECNT.
*/
#define	CAN_NECNT5	(CAN_N5_ECNT)

/** \\brief  718, Node Frame Counter Register */
#define CAN_N5_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018718u)

/** Alias (User Manual Name) for CAN_N5_FCR.
* To use register names with standard convension, please use CAN_N5_FCR.
*/
#define	CAN_NFCR5	(CAN_N5_FCR)

/** \\brief  708, Node Interrupt Pointer Register */
#define CAN_N5_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018708u)

/** Alias (User Manual Name) for CAN_N5_IPR.
* To use register names with standard convension, please use CAN_N5_IPR.
*/
#define	CAN_NIPR5	(CAN_N5_IPR)

/** \\brief  70C, Node Port Control Register */
#define CAN_N5_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001870Cu)

/** Alias (User Manual Name) for CAN_N5_PCR.
* To use register names with standard convension, please use CAN_N5_PCR.
*/
#define	CAN_NPCR5	(CAN_N5_PCR)

/** \\brief  704, Node Status Register */
#define CAN_N5_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018704u)

/** Alias (User Manual Name) for CAN_N5_SR.
* To use register names with standard convension, please use CAN_N5_SR.
*/
#define	CAN_NSR5	(CAN_N5_SR)

/** \\brief  724, Node Timer A Transmit Trigger Register */
#define CAN_N5_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018724u)

/** Alias (User Manual Name) for CAN_N5_TATTR.
* To use register names with standard convension, please use CAN_N5_TATTR.
*/
#define	CAN_NTATTR5	(CAN_N5_TATTR)

/** \\brief  728, Node Timer B Transmit Trigger Register */
#define CAN_N5_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018728u)

