HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_N5_TBTTR.
* To use register names with standard convension, please use CAN_N5_TBTTR.
*/
#define	CAN_NTBTTR5	(CAN_N5_TBTTR)

/** \\brief  71C, Node Timer Clock Control Register */
#define CAN_N5_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001871Cu)

/** Alias (User Manual Name) for CAN_N5_TCCR.
* To use register names with standard convension, please use CAN_N5_TCCR.
*/
#define	CAN_NTCCR5	(CAN_N5_TCCR)

/** \\brief  72C, Node Timer C Transmit Trigger Register */
#define CAN_N5_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001872Cu)

/** Alias (User Manual Name) for CAN_N5_TCTTR.
* To use register names with standard convension, please use CAN_N5_TCTTR.
*/
#define	CAN_NTCTTR5	(CAN_N5_TCTTR)

/** \\brief  720, Node Timer Receive Timeout Register */
#define CAN_N5_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018720u)

/** Alias (User Manual Name) for CAN_N5_TRTR.
* To use register names with standard convension, please use CAN_N5_TRTR.
*/
#define	CAN_NTRTR5	(CAN_N5_TRTR)

/** \\brief  810, Node Bit Timing Register */
#define CAN_N6_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018810u)

/** Alias (User Manual Name) for CAN_N6_BTR.
* To use register names with standard convension, please use CAN_N6_BTR.
*/
#define	CAN_NBTR6	(CAN_N6_BTR)

/** \\brief  800, Node Control Register */
#define CAN_N6_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018800u)

/** Alias (User Manual Name) for CAN_N6_CR.
* To use register names with standard convension, please use CAN_N6_CR.
*/
#define	CAN_NCR6	(CAN_N6_CR)

/** \\brief  814, Node Error Counter Register */
#define CAN_N6_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018814u)

/** Alias (User Manual Name) for CAN_N6_ECNT.
* To use register names with standard convension, please use CAN_N6_ECNT.
*/
#define	CAN_NECNT6	(CAN_N6_ECNT)

/** \\brief  818, Node Frame Counter Register */
#define CAN_N6_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018818u)

/** Alias (User Manual Name) for CAN_N6_FCR.
* To use register names with standard convension, please use CAN_N6_FCR.
*/
#define	CAN_NFCR6	(CAN_N6_FCR)

/** \\brief  808, Node Interrupt Pointer Register */
#define CAN_N6_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018808u)

/** Alias (User Manual Name) for CAN_N6_IPR.
* To use register names with standard convension, please use CAN_N6_IPR.
*/
#define	CAN_NIPR6	(CAN_N6_IPR)

/** \\brief  80C, Node Port Control Register */
#define CAN_N6_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001880Cu)

/** Alias (User Manual Name) for CAN_N6_PCR.
* To use register names with standard convension, please use CAN_N6_PCR.
*/
#define	CAN_NPCR6	(CAN_N6_PCR)

/** \\brief  804, Node Status Register */
#define CAN_N6_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018804u)

/** Alias (User Manual Name) for CAN_N6_SR.
* To use register names with standard convension, please use CAN_N6_SR.
*/
#define	CAN_NSR6	(CAN_N6_SR)

/** \\brief  824, Node Timer A Transmit Trigger Register */
#define CAN_N6_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018824u)

/** Alias (User Manual Name) for CAN_N6_TATTR.
* To use register names with standard convension, please use CAN_N6_TATTR.
*/
#define	CAN_NTATTR6	(CAN_N6_TATTR)

/** \\brief  828, Node Timer B Transmit Trigger Register */
#define CAN_N6_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018828u)

/** Alias (User Manual Name) for CAN_N6_TBTTR.
* To use register names with standard convension, please use CAN_N6_TBTTR.
*/
#define	CAN_NTBTTR6	(CAN_N6_TBTTR)

/** \\brief  81C, Node Timer Clock Control Register */
#define CAN_N6_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001881Cu)

/** Alias (User Manual Name) for CAN_N6_TCCR.
* To use register names with standard convension, please use CAN_N6_TCCR.
*/
#define	CAN_NTCCR6	(CAN_N6_TCCR)

/** \\brief  82C, Node Timer C Transmit Trigger Register */
#define CAN_N6_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001882Cu)

/** Alias (User Manual Name) for CAN_N6_TCTTR.
* To use register names with standard convension, please use CAN_N6_TCTTR.
*/
#define	CAN_NTCTTR6	(CAN_N6_TCTTR)

/** \\brief  820, Node Timer Receive Timeout Register */
#define CAN_N6_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018820u)

/** Alias (User Manual Name) for CAN_N6_TRTR.
* To use register names with standard convension, please use CAN_N6_TRTR.
*/
#define	CAN_NTRTR6	(CAN_N6_TRTR)

/** \\brief  910, Node Bit Timing Register */
#define CAN_N7_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018910u)

/** Alias (User Manual Name) for CAN_N7_BTR.
* To use register names with standard convension, please use CAN_N7_BTR.
*/
#define	CAN_NBTR7	(CAN_N7_BTR)

/** \\brief  900, Node Control Register */
#define CAN_N7_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018900u)

/** Alias (User Manual Name) for CAN_N7_CR.
* To use register names with standard convension, please use CAN_N7_CR.
*/
#define	CAN_NCR7	(CAN_N7_CR)

/** \\brief  914, Node Error Counter Register */
#define CAN_N7_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018914u)

/** Alias (User Manual Name) for CAN_N7_ECNT.
* To use register names with standard convension, please use CAN_N7_ECNT.
*/
#define	CAN_NECNT7	(CAN_N7_ECNT)

/** \\brief  918, Node Frame Counter Register */
#define CAN_N7_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018918u)

/** Alias (User Manual Name) for CAN_N7_FCR.
* To use register names with standard convension, please use CAN_N7_FCR.
*/
#define	CAN_NFCR7	(CAN_N7_FCR)

/** \\brief  908, Node Interrupt Pointer Register */
#define CAN_N7_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018908u)

/** Alias (User Manual Name) for CAN_N7_IPR.
* To use register names with standard convension, please use CAN_N7_IPR.
*/
#define	CAN_NIPR7	(CAN_N7_IPR)

/** \\brief  90C, Node Port Control Register */
#define CAN_N7_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001890Cu)

/** Alias (User Manual Name) for CAN_N7_PCR.
* To use register names with standard convension, please use CAN_N7_PCR.
*/
#define	CAN_NPCR7	(CAN_N7_PCR)

/** \\brief  904, Node Status Register */
#define CAN_N7_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018904u)

