HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_N7_SR.
* To use register names with standard convension, please use CAN_N7_SR.
*/
#define	CAN_NSR7	(CAN_N7_SR)

/** \\brief  924, Node Timer A Transmit Trigger Register */
#define CAN_N7_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018924u)

/** Alias (User Manual Name) for CAN_N7_TATTR.
* To use register names with standard convension, please use CAN_N7_TATTR.
*/
#define	CAN_NTATTR7	(CAN_N7_TATTR)

/** \\brief  928, Node Timer B Transmit Trigger Register */
#define CAN_N7_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018928u)

/** Alias (User Manual Name) for CAN_N7_TBTTR.
* To use register names with standard convension, please use CAN_N7_TBTTR.
*/
#define	CAN_NTBTTR7	(CAN_N7_TBTTR)

/** \\brief  91C, Node Timer Clock Control Register */
#define CAN_N7_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001891Cu)

/** Alias (User Manual Name) for CAN_N7_TCCR.
* To use register names with standard convension, please use CAN_N7_TCCR.
*/
#define	CAN_NTCCR7	(CAN_N7_TCCR)

/** \\brief  92C, Node Timer C Transmit Trigger Register */
#define CAN_N7_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001892Cu)

/** Alias (User Manual Name) for CAN_N7_TCTTR.
* To use register names with standard convension, please use CAN_N7_TCTTR.
*/
#define	CAN_NTCTTR7	(CAN_N7_TCTTR)

/** \\brief  920, Node Timer Receive Timeout Register */
#define CAN_N7_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018920u)

/** Alias (User Manual Name) for CAN_N7_TRTR.
* To use register names with standard convension, please use CAN_N7_TRTR.
*/
#define	CAN_NTRTR7	(CAN_N7_TRTR)

/** \\brief  E8, OCDS Control and Status */
#define CAN_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00180E8u)

/** \\brief  1C4, Panel Control Register */
#define CAN_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00181C4u)

/** \\brief  288, Reference Mark Register */
#define CAN_REFMR /*lint --e(923)*/ (*(volatile Ifx_CAN_REFMR*)0xF0018288u)

/** \\brief  2F8, Scheduler Instruction Status Register */
#define CAN_SISR /*lint --e(923)*/ (*(volatile Ifx_CAN_SISR*)0xF00182F8u)

/** \\brief  3FFC, Scheduler Start Pointer Node 0 Register */
#define CAN_STPTR0 /*lint --e(923)*/ (*(volatile Ifx_CAN_STPTR0*)0xF001BFFCu)

/** \\brief  2F4, Scheduler Timing Status Register High */
#define CAN_STSRH /*lint --e(923)*/ (*(volatile Ifx_CAN_STSRH*)0xF00182F4u)

/** \\brief  2F0, Scheduler Timing Status Register Low */
#define CAN_STSRL /*lint --e(923)*/ (*(volatile Ifx_CAN_STSRL*)0xF00182F0u)

/** \\brief  284, Synchronization Mark Register */
#define CAN_SYNMR /*lint --e(923)*/ (*(volatile Ifx_CAN_SYNMR*)0xF0018284u)

/** \\brief  2C4, Time Trigger Configuration Register */
#define CAN_TTCFGR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTCFGR*)0xF00182C4u)

/** \\brief  2C0, Time Trigger Control Register */
#define CAN_TTCR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTCR*)0xF00182C0u)

/** \\brief  2CC, Time Trigger Flag Modification Register */
#define CAN_TTFMR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTFMR*)0xF00182CCu)

/** \\brief  2D4, Time Trigger Interrupt Enable Register */
#define CAN_TTIER /*lint --e(923)*/ (*(volatile Ifx_CAN_TTIER*)0xF00182D4u)

/** \\brief  2D8, Time Trigger Interrupt Node Pointer Register */
#define CAN_TTINPR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTINPR*)0xF00182D8u)

/** \\brief  2D0, Time Trigger Interrupt Request Register */
#define CAN_TTIRR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTIRR*)0xF00182D0u)

/** \\brief  2C8, Time Trigger Status Register */
#define CAN_TTSR /*lint --e(923)*/ (*(volatile Ifx_CAN_TTSR*)0xF00182C8u)

/** \\brief  290, Time Unit Ratio Register */
#define CAN_TURR /*lint --e(923)*/ (*(volatile Ifx_CAN_TURR*)0xF0018290u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REG_H */
